Revit 2027 API
IFCParameterTemplate.RemovePropertyMappingInfo(PropertySetupType, String, String) Method
 Removes the property mapping from the property set by name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemovePropertyMappingInfo(
	PropertySetupType propertySetupType,
	string propertySetName,
	string propertyName
)
Public Sub RemovePropertyMappingInfo (
	propertySetupType As PropertySetupType,
	propertySetName As String,
	propertyName As String
)
public:
void RemovePropertyMappingInfo(
	PropertySetupType propertySetupType,
	String^ propertySetName,
	String^ propertyName
)
member RemovePropertyMappingInfo :
        propertySetupType : PropertySetupType *
        propertySetName : string *
        propertyName : string -> unit
Parameters
propertySetupType PropertySetupType
 The property setup type.
propertySetName String
 The property set name.
propertyName String
 The property name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCParameterTemplate Class
RemovePropertyMappingInfo Overload
Autodesk.Revit.DB Namespace